hi7tsu/32MX_USBHID_Sample/usb/inc/usb_hal_pic32mx.h
// DOM-IGNORE-BEGIN
/*******************************************************************************
Copyright 2015 Microchip Technology Inc. (www.microchip.com)

Licensed under the Apache License, Version 2.0 (the "License");
you may not use this file except in compliance with the License.
You may obtain a copy of the License at

    http://www.apache.org/licenses/LICENSE-2.0

Unless required by applicable law or agreed to in writing, software
distributed under the License is distributed on an "AS IS" BASIS,
WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
See the License for the specific language governing permissions and
limitations under the License.

To request to license the code under the MLA license (www.microchip.com/mla_license),
please contact mla_licensing@microchip.com
*******************************************************************************/
//DOM-IGNORE-END

#if !defined(USB_HAL_PIC32MX_H)
#define USB_HAL_PIC32MX_H

/*****************************************************************************/
/****** include files ********************************************************/
/*****************************************************************************/

#include <xc.h>
#include <stdint.h>
#include <stdbool.h>
#include "usb_config.h"

/*****************************************************************************/
/****** Constant definitions *************************************************/
/*****************************************************************************/

//Device specific IECx register count.  Useful during interrupt context save and
//restore operations (such as prior to and after entering sleep on suspend).
/* 
#if defined(__32MX210F016B__) || defined(__32MX210F016C__) || defined(__32MX210F016D__)
    //Number of IECx registers implemented in the microcontroller (varies from device to device, make sure this is set correctly for the intended CPU)
    #define DEVICE_SPECIFIC_IEC_REGISTER_COUNT  2   
    #define USB_HAL_VBUSTristate()
    //#define USB_HAL_VBUSTristate()              {TRISBbits.TRISB6 = 1;}
#else
    #warning "Add processor specific definitions here."
#endif
*/

#if (USB_PING_PONG_MODE != USB_PING_PONG__FULL_PING_PONG)
    #error "PIC32 only supports full ping pong mode.  A different mode other than full ping pong is selected in the usb_config.h file."
#endif
#define BDT_NUM_ENTRIES      ((USB_MAX_EP_NUMBER + 1) * 4)


//----- USBEnableEndpoint() input definitions ----------------------------------
#define USB_HANDSHAKE_ENABLED           0x01
#define USB_HANDSHAKE_DISABLED          0x00

#define USB_OUT_ENABLED                 0x08
#define USB_OUT_DISABLED                0x00

#define USB_IN_ENABLED                  0x04
#define USB_IN_DISABLED                 0x00

#define USB_ALLOW_SETUP                 0x00
#define USB_DISALLOW_SETUP              0x10

#define USB_STALL_ENDPOINT              0x02

#define USB_PULLUP_ENABLE               0x00
#define USB_PULLUP_DISABLE              0x04

#define USB_INTERNAL_TRANSCEIVER        0x00
#define USB_EXTERNAL_TRANSCEIVER        0x01

//Note: Low speed device mode is only supported on certain devices.
#define USB_FULL_SPEED                  0x00
#define USB_LOW_SPEED                   0x08


#define USBPingPongBufferReset          U1CONbits.PPBRST

#define USB_OTG_ENABLE                  0x04
#define USB_OTG_DPLUS_ENABLE            0x80


//----- Interrupt Flag definitions --------------------------------------------
#define USBTransactionCompleteIE        U1IEbits.TRNIE
#define USBTransactionCompleteIF        U1IRbits.TRNIF
#define USBTransactionCompleteIFReg     U1IR
#define USBTransactionCompleteIFBitNum  3

#define USBResetIE                      U1IEbits.URSTIE
#define USBResetIF                      U1IRbits.URSTIF
#define USBResetIFReg                   U1IR
#define USBResetIFBitNum                0

#define USBIdleIE                       U1IEbits.IDLEIE
#define USBIdleIF                       U1IRbits.IDLEIF
#define USBIdleIFReg                    U1IR
#define USBIdleIFBitNum                 4

#define USBActivityIE                   U1OTGIEbits.ACTVIE
#define USBActivityIF                   U1OTGIRbits.ACTVIF
#define USBActivityIFReg                U1OTGIR
#define USBActivityIFBitNum             4

#define USBSOFIE                        U1IEbits.SOFIE
#define USBSOFIF                        U1IRbits.SOFIF
#define USBSOFIFReg                     U1IR
#define USBSOFIFBitNum                  2

#define USBStallIE                      U1IEbits.STALLIE
#define USBStallIF                      U1IRbits.STALLIF
#define USBStallIFReg                   U1IR
#define USBStallIFBitNum                7

#define USBErrorIE                      U1IEbits.UERRIE
#define USBErrorIF                      U1IRbits.UERRIF
#define USBErrorIFReg                   U1IR
#define USBErrorIFBitNum                1

#define USBSE0Event                     0
#define USBSuspendControl               U1PWRCbits.USUSPEND
#define USBPacketDisable                U1CONbits.PKTDIS
#define USBResumeControl                U1CONbits.RESUME

#define USBT1MSECIE                     U1OTGIEbits.T1MSECIE
#define USBT1MSECIF                     U1OTGIRbits.T1MSECIF
#define USBT1MSECIFReg                  U1OTGIR
#define USBT1MSECIFBitNum               6

#define USBIDIE                         U1OTGIEbits.IDIE
#define USBIDIF                         U1OTGIRbits.IDIF
#define USBIDIFReg                      U1OTGIR
#define USBIDIFBitNum                   7

#define USBSESVDIE                      U1OTGIEbits.SESVDIE
#define USBSESVDIF                      U1OTGIRbits.SESVDIF
#define USBSESVDReg                     U1OTGIR
#define USBSESVDBitNum                  3

#define USBRESUMEIE                     U1IEbits.RESUMEIE
#define USBRESUMEIF                     U1IRbits.RESUMEIF
#define USBRESUMEIFReg                  U1IR
#define USBRESUMEIFBitNum               5


#if ((__PIC32_FEATURE_SET__ >= 100) && (__PIC32_FEATURE_SET__ <= 499))
    // 1xx, 2xx, 3xx, 4xx
    #define USBInterruptFlag        IFS1bits.USBIF
    #define USBInterruptEnableBit   IEC1bits.USBIE
    #define USBIPLBits              IPC7bits.USBIP
    #define USBISLBits              IPC7bits.USBIS
#elif ((__PIC32_FEATURE_SET__ >= 500) && (__PIC32_FEATURE_SET__ <= 799))
    // 5xx, 6xx, 7xx
    #define USBInterruptFlag        IFS1bits.USBIF
    #define USBInterruptEnableBit   IEC1bits.USBIE
    #define USBIPLBits              IPC11bits.USBIP
    #define USBISLBits              IPC11bits.USBIS
#else
    // unknown
    #error "Unsupported feature set detected: Check usb_hal_pic32mx.h"
#endif


#if defined(USB_INTERRUPT)
    #define USBEnableInterrupts() {\
        USBInterruptEnableBit = 1;\
        USBIPLBits = 4;\
        USBISLBits = 0;\
        INTCONbits.MVEC = 1;\
        __builtin_enable_interrupts();\
    }
    #define USBMaskInterrupts() {USBInterruptEnableBit = 0;}
    #define USBUnmaskInterrupts() {USBInterruptEnableBit = 1;}
#else
    #define USBEnableInterrupts()
    #define USBMaskInterrupts() 
    #define USBUnmaskInterrupts() 
#endif

#define USBDisableInterrupts() {USBInterruptEnableBit = 0;}
#define USBClearUSBInterrupt() {USBInterruptFlag = 0;}

//----- Event call back definitions --------------------------------------------
#if defined(USB_DISABLE_SOF_HANDLER)
    #define USB_SOF_INTERRUPT           0x00
#else
    #define USB_SOF_INTERRUPT           0x04
#endif
#if defined(USB_DISABLE_ERROR_HANDLER)
    #define USB_ERROR_INTERRUPT         0x02
#else
    #define USB_ERROR_INTERRUPT         0x02
#endif

//----- BDnSTAT bit definitions -----------------------------------------------
#define _BSTALL                         0x04        //Buffer Stall enable
#define _DTSEN                          0x08        //Data Toggle Synch enable
#define _DAT0                           0x00        //DATA0 packet expected next
#define _DAT1                           0x40        //DATA1 packet expected next
#define _DTSMASK                        0x40        //DTS Mask
#define _USIE                           0x80        //SIE owns buffer
#define _UCPU                           0x00        //CPU owns buffer
#define _STAT_MASK                      0xFC

//----- USTAT bit definitions -------------------------------------------------
#define USTAT_EP0_PP_MASK               ~0x04
#define USTAT_EP_MASK                   0xFC
#define USTAT_EP0_OUT                   0x00
#define USTAT_EP0_OUT_EVEN              0x00
#define USTAT_EP0_OUT_ODD               0x04
#define USTAT_EP0_IN                    0x08
#define USTAT_EP0_IN_EVEN               0x08
#define USTAT_EP0_IN_ODD                0x0C
#define ENDPOINT_MASK                   0xF0

