hi7tsu/32MX_USBHID_Sample/usb/inc/usb_hal_pic32mx.h
//----- U1EP bit definitions --------------------------------------------------
#define UEP_STALL                       0x0002
// Cfg Control pipe for this ep
#define EP_CTRL                         0x0C
#define EP_OUT                          0x18            // Cfg OUT only pipe for this ep
#define EP_IN                           0x14            // Cfg IN only pipe for this ep
#define EP_OUT_IN                       0x1C            // Cfg both OUT & IN pipes for this ep
#define HSHK_EN                         0x01            // Enable handshake packet
                                                        // Handshake should be disable for isoch


#define BDT_BASE_ADDR_TAG   __attribute__ ((aligned (512)))
#define CTRL_TRF_SETUP_ADDR_TAG
#define CTRL_TRF_DATA_ADDR_TAG

//----- Depricated defintions - will be removed at some point of time----------
//--------- Depricated in v2.2
#define _LS                             0x00        // Use Low-Speed USB Mode
#define _FS                             0x00        // Use Full-Speed USB Mode
#define _TRINT                          0x00        // Use internal transceiver
#define _TREXT                          0x00        // Use external transceiver
#define _PUEN                           0x00        // Use internal pull-up resistor
#define _OEMON                          0x00        // Use SIE output indicator

/*****************************************************************************/
/****** Type definitions *****************************************************/
/*****************************************************************************/

// Buffer Descriptor Status Register layout.
typedef union __attribute__ ((packed)) _BD_STAT
{
    struct __attribute__ ((packed)){
        unsigned            :2;
        unsigned    BSTALL  :1;     //Buffer Stall Enable
        unsigned    DTSEN   :1;     //Data Toggle Synch Enable
        unsigned            :2;     //Reserved - write as 00
        unsigned    DTS     :1;     //Data Toggle Synch Value
        unsigned    UOWN    :1;     //USB Ownership
    };
    struct __attribute__ ((packed)){
        unsigned            :2;
        unsigned    PID0    :1;
        unsigned    PID1    :1;
        unsigned    PID2    :1;
        unsigned    PID3    :1;

    };
    struct __attribute__ ((packed)){
        unsigned            :2;
        unsigned    PID     :4;         //Packet Identifier
    };
    uint16_t           Val;
} BD_STAT;

// BDT Entry Layout
typedef union __attribute__ ((packed))__BDT
{
    struct __attribute__ ((packed))
    {
        BD_STAT         STAT;
        uint16_t        CNT:10;
        uint32_t        ADR;                      //Buffer Address
    };
    struct __attribute__ ((packed))
    {
        uint32_t        res  :16;
        uint32_t        count:10;
    };
    uint32_t            w[2];
    uint16_t            v[4];
    uint64_t            Val;
} BDT_ENTRY;

// USTAT Register Layout
typedef union __USTAT
{
    struct
    {
        unsigned char filler1           :2;
        unsigned char ping_pong         :1;
        unsigned char direction         :1;
        unsigned char endpoint_number   :4;
    };
    uint8_t Val;
} USTAT_FIELDS;

//Macros for fetching parameters from USTAT_FIELDS variable.
#define USBHALGetLastEndpoint(stat)     stat.endpoint_number
#define USBHALGetLastDirection(stat)    stat.direction
#define USBHALGetLastPingPong(stat)     stat.ping_pong


typedef union _POINTER
{
    struct
    {
        uint8_t bLow;
        uint8_t bHigh;
        //uint8_t bUpper;
    };
    uint16_t _uint16_t;                         // bLow & bHigh

    //pFunc _pFunc;                       // Usage: ptr.pFunc(); Init: ptr.pFunc = &<Function>;

    uint8_t* bRam;                         // Ram byte pointer: 2 bytes pointer pointing
                                        // to 1 byte of data
    uint16_t* wRam;                         // Ram word pointer: 2 bytes pointer pointing
                                        // to 2 bytes of data

    const uint8_t* bRom;                     // Size depends on compiler setting
    const uint16_t* wRom;
    //const near uint8_t* nbRom;               // Near = 2 bytes pointer
    //const near uint16_t* nwRom;
    //const far uint8_t* fbRom;                // Far = 3 bytes pointer
    //const far uint16_t* fwRom;
} POINTER;

/*****************************************************************************/
/****** Function prototypes and macro functions ******************************/
/*****************************************************************************/

#define ConvertToPhysicalAddress(a)   ((uint32_t)KVA_TO_PA(a))
#define ConvertToVirtualAddress(a)    PA_TO_KVA1(a)

// Virtual Addr to Physical Addr
#ifndef KVA_TO_PA
    #define KVA_TO_PA(kva) ((uint32_t)(kva) & 0x1fffffff)
#endif

// Physical Addr to Virtual Addr(KSEG1)
#ifndef PA_TO_KVA1
    #define PA_TO_KVA1(pa)    ((uint32_t)(pa) | 0xA0000000)
#endif


/********************************************************************
 * Function (macro): void USBClearInterruptFlag(register, uint8_t if_flag_offset)
 *
 * PreCondition:    None
 *
 * Input:
 *   register - the register mnemonic for the register holding the interrupt
 *				flag to be "kleared"
 *   uint8_t if_flag_offset - the bit position offset (for the interrupt flag to
 *							"klear") fconst the "right of the register"
 *
 * Output:          None
 *
 * Side Effects:    None
 *
 * Overview:        Klears the specified USB interrupt flag.
 *
 * Note:    		Individual USB interrupt flag bits are "Kleared" by writing
 *					'1' to the bit
 *******************************************************************/
#define USBClearInterruptFlag(reg_name, if_flag_offset)	(reg_name = (1 << if_flag_offset))


#if !defined(Sleep)
    #define REGISTER_UNLOCK_SEQUENCE()  {SYSKEY = 0; SYSKEY = 0xAA996655; SYSKEY = 0x556699AA;}
    #define REGISTER_LOCK_SEQUENCE()    {SYSKEY = 0;}
    #define WRITE_OSCCON(newVal)        {REGISTER_UNLOCK_SEQUENCE(); OSCCON = newVal; REGISTER_LOCK_SEQUENCE();}
    #define Sleep()                     {WRITE_OSCCON(OSCCON | 0x00000010); _wait();}       //Set OSCCON<SLPEN> = 1 (to sleep instead of idle), then execute wait instruction)
#endif


