hi7tsu/32MX_USBHID_Sample/usb/inc/usb_hal_pic32mx.h
#define SetConfigurationOptions()       {U1CNFG1 = USB_SPEED_OPTION; U1EIE = 0x9F; U1IE = 0x99 | USB_SOF_INTERRUPT | USB_ERROR_INTERRUPT; U1OTGCON &= 0x000F;  U1OTGCON |= USB_PULLUP_OPTION;}


/********************************************************************
Function:
    bool USBSleepOnSuspend(void)

Summary:
    Places the core into sleep and sets up the USB module
    to wake up the device on USB activity (either USB host resume or
    USB VBUS going away, such as due to USB cable detach).

PreCondition:
    The USBDeviceInit() function should have been called at least once and the
    USB host should have suspended the USB device.

Parameters:
    None

Return Values:
    true  - if entered sleep successfully
    false - if there was an error entering sleep

Remarks:
    Please note that before calling this function that it is the
    responsibility of the application to place all of the other
    peripherals or board features into a lower power state if
    required.

    Based on the USB specifications, upon detection of the suspend condition, a
    USB device should promptly put itself into a low power mode (such that it consumes
    no more than 2.5mA from the USB host (unless the host is a USB type-C host and
    is actively advertising higher than standard USB spec current capability).

*******************************************************************/
bool USBSleepOnSuspend(void);

/****************************************************************
    Function:
        void USBPowerModule(void)

    Description:
        This macro is used to power up the USB module if required:
        PIC16: defines as nothing
        PIC18: defines as nothing
        PIC24: defines as U1PWRCbits.USBPWR = 1;
        PIC32: defines as U1PWRCbits.USBPWR = 1;

    Parameters:
        None

    Return Values:
        None

    Remarks:
        None

  ****************************************************************/
#define USBPowerModule() U1PWRCbits.USBPWR = 1;

/****************************************************************
    Function:
        void USBModuleDisable(void)

    Description:
        This macro is used to disable the USB module.  This will perform a
        USB soft detach operation from the host, if the device was already plugged
        into the host at the time of calling this function.  All USB module
        features including the internal USB 1ms timer and the USB VBUS
        monitoring comparators will be disabled.

    Parameters:
        None

    Return Values:
        None

    Remarks:
        None

  ****************************************************************/
#define USBModuleDisable() {\
    U1CON = 0;\
    U1IE = 0;\
    U1OTGIE = 0;\
    U1PWRCbits.USUSPND = 0;\
    U1PWRCbits.USBPWR = 0;\
    USBDeviceState = DETACHED_STATE;\
}

/****************************************************************
    Function:
        USBSetBDTAddress(addr)

    Description:
        This macro is used to power up the USB module if required

    Parameters:
        None

    Return Values:
        None

    Remarks:
        None

  ****************************************************************/
#define USBSetBDTAddress(addr)         {U1BDTP3 = (((uint32_t)KVA_TO_PA(addr)) >> 24); U1BDTP2 = (((uint32_t)KVA_TO_PA(addr)) >> 16); U1BDTP1 = (((uint32_t)KVA_TO_PA(addr)) >> 8);}

/****************************************************************
    Function:
        void USBClearInterruptRegister(int register)

    Description:
        Clears all of the interrupts in the requested register

    Parameters:
        register - the register that needs to be cleared.

    Return Values:
        None

    Remarks:
        Note that on these devices to clear an interrupt you must
        write a '1' to the interrupt location.

  ****************************************************************/
#define USBClearInterruptRegister(reg)  {reg = 0xFFFFFFFF;}

/********************************************************************
    Function:
        void USBClearInterruptFlag(register, uint8_t if_flag_offset)

    Summary:
        Clears the specified USB interrupt flag.

    PreCondition:
        None

    Parameters:
        register - the register mnemonic for the register holding the interrupt
                   flag to be cleared
        uint8_t if_flag_offset - the bit position offset (for the interrupt flag to
                   clear) from the "right of the register"

    Return Values:
        None

    Remarks:
        Individual USB interrupt flag bits are cleared by writing '1' to the
        bit, in a word write operation.

 *******************************************************************/
#define USBClearInterruptFlag(reg_name, if_flag_offset)	(reg_name = (1 << if_flag_offset))

/********************************************************************
    Function:
        void DisableNonZeroEndpoints(UINT8 last_ep_num)

    Summary:
        Clears the control registers for the specified non-zero endpoints

    PreCondition:
        None

    Parameters:
        UINT8 last_ep_num - the last endpoint number to clear.  This
        number should include all endpoints used in any configuration.

    Return Values:
        None

    Remarks:
        None

 *******************************************************************/
#define DisableNonZeroEndpoints(last_ep_num)          {\
            uint8_t i;\
            uint32_t *p = (uint32_t*)&U1EP1;\
            for(i=0;i<last_ep_num;i++)\
            {\
                *p = 0;\
                p += 4;\
            }\
        }

/********************************************************************
Function:
    bool USBRemoteWakeupAssertBlocking(void)

Summary:
    Checks if it is currently legal to send remote wakeup signaling to the
    host, and if so, it sends it.  This is a blocking function that takes ~5-6ms
    to execute.

PreCondition:

Parameters:
    None

Return Values:
    true  - if it was legal to send remote wakeup signaling and the signaling was sent
    false - if it was not legal to send remote wakeup signaling (in this case, no signaling gets sent)

